#include "LBsystem.h"
#include <stdio.h>
char* Map[4] = { " ", "숲", "사막", "설산" };

void Battle_start() {
	printf("==============================================================================================================\n\n");
	if (Stage == 0) {
		printf("[ 수상한 남성 ]이 당신에게 전투를 걸어왔습니다.\n");
		Sleep(750);
		printf("왜인지 이 전투는 피할 수 없을 것 같은 기분이 듭니다.\n");
		Sleep(750);
		printf("당신은 주사위를 들며 전투 자세를 취했습니다.\n\n");
		Sleep(500);
	}
	else if (Battlecount < 5) {
		if (Elite == 0) {
			printf("%s를 거닐던 중 [ %s ]이/가 당신에게 전투를 걸어왔습니다.\n", Map[Stage], Mobname());
		}
		else if (Elite == 1) {
			printf("%s를 거닐던 중 정예 몬스터 [ %s ]이/가 당신에게 전투를 걸어왔습니다.\n\n", Map[Stage], Mobname());
		}
		Sleep(750);
		printf("당신은 당당하게 싸우거나 훗날을 도모하며 전략적 후퇴를 할 수 있습니다.\n");
		Sleep(750);
		printf("선택은 플레이어의 몫입니다.\n\n\n");
		Sleep(500);
		printf("--------------------------------------------------------------------------------------------------------------\n\n\n");
		printf("[(1) 싸운다.]\n[(2) 도망친다.]\n\n");
	}
	printf("==============================================================================================================\n\n");
	Sleep(500);
}

void Battle_Boss() {
	printf("==============================================================================================================\n\n");
	printf("%s의 끝에 다다른 당신은 [ %s ]을/를 마주했습니다.\n", Map[Stage], Mobname());
	Sleep(750);
	printf("그 거대한 위압감으로부터 당신은 결코 도망갈 수 없다는 것을 느낍니다.\n");
	Sleep(750);
	printf("당신은 어쩔 수 없이 주사위를 들며 전투 자세를 취했습니다.\n\n");
	Sleep(750);
	printf("자비 또는 흥미, 어쩌면 오만일 지도 모르는 무언가 덕분에 보스는 당신에게 선공을 양보합니다.\n\n");
	Sleep(500);
	printf("==============================================================================================================\n\n");
	Sleep(500);
	system("pause");
	Clearscreen();
}

void Battle_1() {
	printf("==============================================================================================================\n\n");
	if (++Battleturn % 2 == 0) {
		printf("\20[%d턴]\t[상대의 턴]\n\n", Battleturn);
	}
	else {
		printf("\20[%d턴]\t[당신의 턴]\n\n", Battleturn);
	}
	printf("[ %s ]\n[적의 체력 : %d/%d]\t[적의 행운 : %d]\n\n\n", Mobname(), Mob_Hp, Mob_Maxhp, Mob_Luck);
	printf("[당신의 체력 : %d/%d]\n[행운 : %d]\t\t[믿음 : %d]\n\n\n", P_Hp, P_Maxhp, P_Luck, P_Belief);
	if (Battleturn % 2 == 0) {
		printf("상대는 당신에게 %d만큼 피해를 입히려고 합니다.\n\n\n", DMG);
		printf("--------------------------------------------------------------------------------------------------------------\n\n\n");
		printf("[(1) 방어한다.]\n[(2) 회피한다.]\n\n");
	}
	else {
		printf("\n--------------------------------------------------------------------------------------------------------------\n\n\n");
		printf("[(1) 공격한다.]\n[(2) 회복한다.]\n\n");
	}

	printf("==============================================================================================================\n\n");
	Sleep(500);
}

void Battle_ATK() {
	Mob_Hp -= P_DMG();
	Mob_Hp <= 0 ? Mob_Hp = 0 : Mob_Hp == Mob_Hp;
	printf("==============================================================================================================\n\n");
	printf("당신은 상대에게 %d만큼 피해를 입혔습니다.\n\n", P_DMG());
	printf("==============================================================================================================\n\n");
	Sleep(500);
	system("pause");
	Clearscreen();
}

void Battle_HEAL() {
	P_Hp += P_DMG();
	P_Hp > P_Maxhp ? P_Hp = P_Maxhp : P_Hp == P_Hp;
	printf("==============================================================================================================\n\n");
	printf("당신은 %d만큼 회복했습니다.\n\n", P_DMG());
	printf("==============================================================================================================\n\n");
	Sleep(500);
	system("pause");
	Clearscreen();
}

void Battle_DEF_1() {
	int Dmg = (DMG - (Dice1 + Dice2 + P_Belief)) > 0 ? (DMG - (Dice1 + Dice2 + P_Belief)) : 0;
	P_Hp -= Dmg;
	P_Hp <= 0 ? P_Hp = 0 : P_Hp == P_Hp;
	printf("==============================================================================================================\n\n");
	printf("당신은 공격을 막아내어 %d만큼 피해를 입었습니다.\n\n", Dmg);
	printf("==============================================================================================================\n\n");
	Sleep(500);
	system("pause");
	Clearscreen();
}

void Battle_DEF_2() {
	if (Dice1 + Dice2 > Dn) {
		printf("==============================================================================================================\n\n");
		printf("당신은 상대의 공격을 피했습니다.\n\n");
		printf("==============================================================================================================\n\n");
		Sleep(500);
		system("pause");
		Clearscreen();
	}
	else {
		P_Hp -= DMG;
		P_Hp <= 0 ? P_Hp = 0 : P_Hp == P_Hp;
		printf("==============================================================================================================\n\n");
		printf("당신은 회피에 실패하여 %d만큼 피해를 입었습니다.\n\n", DMG);
		printf("==============================================================================================================\n\n");
		Sleep(500);
		system("pause");
		Clearscreen();
	}
}

void Battle_Escape() {
	printf("==============================================================================================================\n\n");
	printf("당신은 무사히 도망쳤습니다.\n\n");
	printf("==============================================================================================================\n\n");
	Sleep(500);
	system("pause");
	Clearscreen();
}

void Battle_TurnEnd() {
	printf("==============================================================================================================\n\n");
	printf("턴이 종료되었습니다.\n\n");
	printf("==============================================================================================================\n\n");
	Sleep(500);
	system("pause");
	Clearscreen();
}

void Battle_Win() {
	printf("==============================================================================================================\n\n");
	printf("치열한 전투 끝에 행운의 여신은 당신을 선택한 듯 합니다.\n");
	Sleep(750);
	printf("그 덕에 당신은 운명적인 승리를 거머쥐었습니다.\n\n");
	Sleep(500);
	printf("==============================================================================================================\n\n");
	Sleep(500);
	system("pause");
	Clearscreen();
}

void Battle_BossWin() {
	printf("==============================================================================================================\n\n");
	printf("당신은 이길 수 없는 적을 상대로 버텨내는 것에 성공하였습니다.\n");
	Sleep(750);
	printf("또한 당신은 버틸 수 없는 적을 쓰러트렸습니다.\n");
	Sleep(750);
	printf("강대한 적은 이제 닿을 수 없는 별이 아니게 되었습니다.\n");
	Sleep(750);
	printf("그리고 당신은 새로운 전설에 이름을 올렸습니다.\n");
	Sleep(750);
	printf("당신의 이야기는 아직 끝나지 않았습니다.\n");
	Sleep(750);
	printf("새로운 필드를 향해 당신의 발걸음이 다시 시작됩니다.\n");
	Sleep(750);
	printf("그러나 자물쇠가 부숴짐에 따라 모든 주사위의 면이 1개 늘어납니다.\n\n");
	Sleep(500);
	printf("==============================================================================================================\n\n");
	Sleep(500);
	system("pause");
	Clearscreen();
}