#include "LBsystem.h"
#include <stdio.h>

void MainEvent() {
	int a = 0;
	P_Hp = Getrandom(20, 35);
	P_Maxhp = P_Hp;
	a = Getrandom(1, 100);
	if (a <= 65) {
		P_Luck = 0;
	}
	else if (a <=90) {
		P_Luck = 1;
	}
	else {
		P_Luck = 2;
	}
	a = Getrandom(1, 100);
	if (a <= 65) {
		P_Belief = 0;
	}
	else if (a <= 90) {
		P_Belief = 1;
	}
	else {
		P_Belief = 2;
	}
	a = Getrandom(1, 20);
	if (a == 1) {
		P_Dn += 1;
	}
	printf("==============================================================================================================\n\n");
	printf("숲을 돌아다니던 당신은 의문의 빛이 떠다니는 것을 보았습니다.\n");
	Sleep(750);
	printf("강렬한 빛은 이윽고 당신에게 다가와 당신의 품에 들어왔습니다.\n");
	Sleep(750);
	printf("빛이 당신과 하나가 되어 사라지자 당신은 몸이 변하는 것을 느낍니다.\n");
	Sleep(750);
	printf("당신의 최대 체력이 %d으로 조정되었습니다.\n", P_Maxhp);
	Sleep(750);
	printf("또한 당신의 행운과 믿음이 각각 %d, %d으로 조정되었습니다.\n", P_Luck, P_Belief);
	Sleep(750);
	if (a == 1) {
		printf("운이 좋게도 당신의 주사위가 빛에 반응하였습니다	.\n");
		Sleep(750);
	}
	printf("현재 당신의 주사위는 %d면체입니다.\n\n", Dn+P_Dn);
	Sleep(500);
	printf("==============================================================================================================\n\n");
	Sleep(500);
	system("pause");
	Clearscreen();
}

void Event1() {//행운 1증가
	P_Luck += 1;
	printf("==============================================================================================================\n\n");
	printf("%s을 걷던 당신은 길가에 놓인 네잎클로버를 발견했습니다.\n", Map[Stage]);
	Sleep(750);
	printf("당신은 사소하더라도 확실한 행운에 기쁨을 느낍니다.\n");
	Sleep(750);
	printf("네잎클로버를 주워서 당신의 행운이 1만큼 증가했습니다.\n");
	Sleep(750);
	printf("현재 당신의 행운은 %d입니다.\n\n", P_Luck);
	Sleep(500);
	printf("==============================================================================================================\n\n");
	Sleep(500);
	system("pause");
	Clearscreen();
}

void Event2() {//믿음 1증가
	P_Belief += 1;
	printf("==============================================================================================================\n\n");
	printf("%s을 걷던 당신은 버려진 행운의 여신상을 발견했습니다.\n", Map[Stage]);
	Sleep(750);
	printf("산화되어 초록빛을 띄는 작은 조각상은 당신의 마음을 조금 채웠습니다.\n");
	Sleep(750);
	printf("당신은 여신상을 다시 바닥에 두었습니다. 다른 이들을 위해 기회를 남겨 주듯이.\n");
	Sleep(750);
	printf("그럼에도 여전히 여신상은 당신의 마음 속 이주민입니다.\n");
	Sleep(750);
	printf("당신의 믿음이 1만큼 증가했습니다.\n");
	Sleep(750);
	printf("현재 당신의 믿음은 %d입니다.\n\n", P_Belief);
	Sleep(500);
	printf("==============================================================================================================\n\n");
	Sleep(500);
	system("pause");
	Clearscreen();
}

void Event3() {//최대체력 3증가
	P_Maxhp += 3;
	P_Hp += 3;
	printf("==============================================================================================================\n\n");
	printf("%s을 걷던 당신은 햇살을 닮은 미약한 빛을 발견했습니다.\n", Map[Stage]);
	Sleep(750);
	printf("허공을 떠다니던 빛이 당신에게 스며듭니다.\n");
	Sleep(750);
	printf("당신은 최대 체력이 3만큼 증가한 것을 알아차렸습니다.\n");
	Sleep(750);
	printf("현재 당신의 최대 체력은 %d입니다.\n\n", P_Maxhp);
	Sleep(500);
	printf("==============================================================================================================\n\n");
	Sleep(500);
	system("pause");
	Clearscreen();
}

void Event4() {//체력 6회복
	P_Hp += 6;
	if (P_Hp > P_Maxhp) {
		P_Hp = P_Maxhp;
	}
	printf("==============================================================================================================\n\n");
	printf("%s을 걷던 당신은 부숴진 상자더미 속에서 액체가 든 유리병을 발견했습니다.\n", Map[Stage]);
	Sleep(750);
	printf("미약한 붉은 색의 액체는 당신에게 도움이 될 것이라는 직감이 느껴집니다.\n");
	Sleep(750);
	printf("당신은 조금 머뭇거렸지만 결국 붉은 액체를 마십니다.\n");
	Sleep(750);
	printf("씁쓸하지만 약간은 달큰한 맛, 마치 당귀를 닮은 맛이 혀를 지나갑니다.\n");
	Sleep(750);
	printf("동시에 당신은 체력이 6만큼 회복된 것을 느낍니다.\n");
	Sleep(750);
	printf("현재 당신의 체력은 %d입니다.\n\n", P_Hp);
	Sleep(500);
	printf("==============================================================================================================\n\n");
	Sleep(500);
	system("pause");
	Clearscreen();
}

void Event5() {//체력 12회복
	P_Hp += 12;
	if (P_Hp > P_Maxhp) {
		P_Hp = P_Maxhp;
	}
	printf("==============================================================================================================\n\n");
	printf("%s을 걷던 당신에게 무지개를 담은 듯한 날개를 지닌 나비가 날아옵니다.\n", Map[Stage]);
	Sleep(750);
	printf("빛을 반사하며 반짝이는 날개가 복합적인 색으로 빛나는 광경에 당신은 가만히 멈춰 섭니다.\n");
	Sleep(750);
	printf("당신이 나비를 멍하게 구경하는 사이 나비가 뿌리는 가루가 당신에게 스며듭니다.\n");
	Sleep(750);
	printf("은은하게 반짝이는 가루로 당신의 체력이 12만큼 회복되었습니다.\n");
	Sleep(750);
	printf("현재 당신의 체력은 %d입니다.\n\n", P_Hp);
	Sleep(500);
	printf("==============================================================================================================\n\n");
	Sleep(500);
	system("pause");
	Clearscreen();
}

void Event6() {//올스탯 1증가
	P_Luck += 1;
	P_Belief += 1;
	P_Maxhp += 1;
	P_Hp += 1;
	printf("==============================================================================================================\n\n");
	printf("%s을 걷던 당신은 한 노점상을 발견했습니다.\n", Map[Stage]);
	Sleep(750);
	printf("당신은 노점에 놓여있는 막대 아이스크림 하나를 구매합니다.\n");
	Sleep(750);
	printf("아이스크림을 다 먹은 당신은 막대에 써있는 글자를 확인합니다.\n\n");
	Sleep(750);
	printf("\"하나 더!\"\n\n");
	Sleep(750);
	printf("당신은 달콤한 행운에 휩싸인 느낌을 받습니다.\n");
	Sleep(750);
	printf("당신의 모든 스탯이 증가했습니다.\n");
	Sleep(750);
	printf("현재 당신의 행운/믿음/최대 체력은 %d/%d/%d입니다.\n\n", P_Luck, P_Belief, P_Maxhp);
	Sleep(500);
	printf("==============================================================================================================\n\n");
	Sleep(500);
	system("pause");
	Clearscreen();
}

void Event7() {//행운, 믿음 1 증가
	P_Luck += 1;
	P_Belief += 1;
	printf("==============================================================================================================\n\n");
	printf("%s을 걷던 당신은 비보잉을 하는 비버를 목도했습니다.\n", Map[Stage]);
	Sleep(750);
	printf("당신의 눈을 강타하는 장면은 정상적인 사고로는 도저히 이해할 수 없습니다.\n");
	Sleep(750);
	printf("동시에 누구나 쉽게 볼 수 없는 장면이기도 하기에 당신은 행운이 오른 것을 느낍니다.\n");
	Sleep(750);
	printf("또한 비버조차 비보잉을 할 수 있으니, 당신도 노력하여 무엇이라도 할 수 있을 것이라는 믿음을 갖습니다.\n");
	Sleep(750);
	printf("현재 당신의 행운/믿음은 %d/%d입니다.\n\n", P_Luck, P_Belief);
	Sleep(500);
	printf("==============================================================================================================\n\n");
	Sleep(500);
	system("pause");
	Clearscreen();
}

void Event8() {//최대체력 3증가 및 체력 6 회복
	P_Maxhp += 3;
	P_Hp += 9;
	if (P_Hp > P_Maxhp) {
		P_Hp = P_Maxhp;
	}
	printf("==============================================================================================================\n\n");
	printf("%s을 걷던 당신은 햇살을 닮은 미약한 빛을 발견했습니다.\n", Map[Stage]);
	Sleep(750);
	printf("허공을 떠다니던 빛이 당신에게 스며듭니다.\n");
	Sleep(750);
	printf("당신은 최대 체력이 3만큼 증가한 것을 알아차렸습니다.\n");
	Sleep(750);
	printf("현재 당신의 최대 체력은 %d입니다.\n\n", P_Maxhp);
	Sleep(500);
	printf("==============================================================================================================\n\n");
	Sleep(500);
	system("pause");
	Clearscreen();
}