#include "LBsystem.h"
#include <stdio.h>

void Text_start() {
	printf("==============================================================================================================\n");
	printf("\t\t\t\t\t행\t운\t싸\t움\n");
	printf("==============================================================================================================\n\n");
	printf("\t\t\t\t\t\t|선택하다|\n\n\n");
	printf("\t\t\t\t[1.시작하다]\t\t     [2.그만두다]\n\n");
	printf("==============================================================================================================\n\n");

	for (int Re = 4; Re > 0 && Choice == 0; Re--) { // 게임 시작
		Sleep(500);
		printf("고르다.");
		Choice = _getch();

		switch (Choice) {
		case 49: {//게임 시작
			Clearscreen();
			printf("==============================================================================================================\n\n");
			printf("게임 시작!\n\n");
			printf("==============================================================================================================\n\n");
			system("pause");
			break;
		}
		case 50: {//게임 종료
			Clearscreen();
			printf("==============================================================================================================\n\n");
			printf("게임 종료!\n\n");
			printf("==============================================================================================================\n\n");
			system("pause");
			P_Hp = 0;
			break;
		}
		default: {//3번 반복
			printf("\n\n==============================================================================================================\n\n");
			printf("다시 시도하다\n");
			printf("남은 기회 %d\n", Re - 1);
			printf("\n==============================================================================================================\n\n");
			Choice = 0;

			if (Re == 1) {
				Choice = 0;
				P_Hp = -1;
			}

			continue;
		}
		}
	}
	return;
}

void Text_prologue_1() {
	printf("==============================================================================================================\n\n");
	printf("당신은 고된 하루를 끝내고 집을 향해 발걸음을 옮겼습니다.\n");
	Sleep(1000);
	printf("신나기도, 무겁기도 한 다리가 횡단보도 앞에서 멈춘 채 얼마나 기다렸을까요.\n");
	Sleep(1000);
	printf("붉은 신호등의 빛이 푸르게 물들었습니다.\n");
	Sleep(1000);
	printf("횡단보도가 바뀐 것을 본 당신은 바로 횡단보도를 건넜습니다.\n\n");
	Sleep(1000);
	printf("집에 도착한 당신은 남은 과제를 생각하며 현관문을 열었습니다.\n");
	Sleep(1000);
	printf("그러나 평소 너무 많이 밤을 세운 탓이었을까요?\n");
	Sleep(1000);
	printf("당신은 갑자기 눈 앞이 깜깜해지는 것을 느꼈습니다.\n\n");
	Sleep(500);
	printf("==============================================================================================================\n\n");
	Sleep(500);
	system("pause");
	Clearscreen();
	return;
}

void Text_prologue_2() {
	printf("==============================================================================================================\n\n");
	printf("형형색색의 꽃과 울창한 나무가 가득하고, 작은 새들이 날아다니는 푸른 숲.\n");
	Sleep(1000);
	printf("눈을 뜬 당신의 앞에는 수상한 남성이 있었습니다.\n\n");
	Sleep(1000);
	printf("\"옷을 보니 이 세상 사람이 아니구만.\"\n");
	Sleep(1000);
	printf("\"자네나 나와 같은 사람들은 도전자라고 불린다네.\"\n\n");
	Sleep(1000);
	printf("로브를 쓴 남성은 당신을 도전자라고 칭했습니다.\n");
	Sleep(1000);
	printf("그는 혼란스러운 당신에게 더욱 충격적인 사실을 알려줍니다.\n\n");
	Sleep(1000);
	printf("\"이 세계는 운이 전부인 세계.\"\n");
	Sleep(1000);
	printf("\"돈이든 힘이든 명예든 전부 운으로 정해지지.\"\n\n");
	Sleep(1250);
	printf("눈 앞에 있는 음침한 남자의 말은 당신에게 잘 이해가 되지 않습니다.\n");
	Sleep(1000);
	printf("그러나 단 한가지만은 확실해 보입니다.\n");
	Sleep(1000);
	printf("이제부터 당신은 새로운 세계에 적응해야한다는 것입니다.\n\n");
	Sleep(500);
	printf("==============================================================================================================\n\n");
	Sleep(500);
	system("pause");
	Clearscreen();
	return;
}

void Text_tutorial() {
	printf("==============================================================================================================\n\n\n");
	printf("|튜토리얼을 진행하시겠습니까?|\n\n");
	printf("[(1) 한다.]\n[(그 외) 하지 않는다.]\n\n\n");
	printf("==============================================================================================================\n\n\n");
	return;
}

void Text_tutorial_o() {
	printf("==============================================================================================================\n\n");
	printf("당신이 멀뚱거리며 서있자, 남성이 입을 열었습니다.\n\n");
	Sleep(1000);
	printf("\"잘 이해가 되지 않아 보이는군.\"\n");
	Sleep(1000);
	printf("\"뭐, 100번의 말보다 1번의 다이스롤이 더 좋다는 말도 있지.\"\n\n");
	Sleep(1000);
	printf("남성은 당신의 겉옷을 가리키며 말했습니다.\n\n");
	Sleep(1000);
	printf("\"자네의 품 속에 주사위 2개가 있을 거네\"\n\n");
	Sleep(1000);
	printf("그의 말대로 당신이 품에는 D3 주사위가 2개 있었습니다.\n");
	Sleep(1000);
	printf("당신이 주사위를 확인하자, 낯선 남성이 당신에게 운 싸움을 걸어왔습니다.\n\n");
	Sleep(1000);
	printf("\"자, 운 싸움을 시작하도록 하지!\"\n\n");
	Sleep(500);
	printf("==============================================================================================================\n\n");
	Sleep(500);
	system("pause");
	Clearscreen();
	return;
}

void Text_tutorial_n() {
	printf("==============================================================================================================\n\n");
	printf("당신이 멀뚱거리며 서있자, 남성이 입을 열었습니다.\n\n");
	Sleep(1000);
	printf("\"잘 이해가 되지 않아 보이는군.\"\n\n");
	Sleep(1000);
	printf("그 순간 맑고 화창하던 하늘에서 번개가 내려쳤습니다.\n\n");
	Sleep(1000);
	printf("\"크아아악!!!\"\n\n");
	Sleep(1000);
	printf("상황을 파악하고 나니, 로브를 쓴 남성은 마른 하늘의 날벼락에 죽은 뒤였습니다.\n");
	Sleep(1000);
	printf("남성의 죽음에 당황할 틈도 없이 당신의 품에서 D3 주사위 2개가 떨어졌습니다.\n");
	Sleep(1000);
	printf("당신은 떨어진 주사위를 주우며 참 이상한 일이라고 생각했습니다.\n");
	Sleep(1000);
	printf("미지의 숲, 미지의 공간, 미지의 세계.\n");
	Sleep(1000);
	printf("수상한 세상에 도착하여도, 죽음을 목도하여도 당신은 패닉에 빠지지 않았습니다.\n");
	Sleep(1000);
	printf("당신은 그저 숲 속을 거닐기 시작했습니다.\n\n");
	Sleep(500);
	printf("==============================================================================================================\n\n");
	Sleep(500);
	system("pause");
	Clearscreen();
	return;
}