#include "LBsystem.h"
#include <stdio.h>

void Battle_tutorial() {
	printf("==============================================================================================================\n\n");
	printf("\20[%d턴]\t[당신의 턴]\n\n\n", ++Battleturn);
	printf("[ 수상한 남성 ]\n[적의 체력 : %d/%d]\t[적의 행운 : %d]\n\n\n", Mob_Hp, Mob_Maxhp, Mob_Luck);
	printf("[당신의 체력 : %d/%d]\n[행운 : %d]\t\t[믿음 : %d]\n\n\n", P_Hp, P_Maxhp, P_Luck, P_Belief);
	printf("--------------------------------------------------------------------------------------------------------------\n\n\n");
	printf("[(1) 공격한다.]\n[(2) 회복한다.]\n\n");
	printf("==============================================================================================================\n\n");
	Sleep(750);
	printf("==============================================================================================================\n\n");
	Sleep(750);
	printf("\"이건 전투의 기본적인 인터페이스다.\"\n");
	Sleep(750);
	printf("\"네가 [현재 턴]이나 [체력]을 모른다고 생각하진 않겠다.\"\n");
	Sleep(750);
	printf("\"[행운]은 주사위를 굴려 나온 공격값이나 회복값에 값을 추가해주지.\"\n");
	Sleep(750);
	printf("\"적은 회복을 하지 못 하니 적의 [행운]은 공격값만 늘려준다.\"\n");
	Sleep(750);
	printf("\"다음으로 [믿음]은 방어값과 이벤트의 판정값을 올려주지.\"\n");
	Sleep(750);
	printf("\"우선 [공격]을 해봐라.\"\n\n");
	Sleep(750);
	printf("==============================================================================================================\n\n");
	while (1) {
		Choice = _getch();
		switch (Choice) {
		case 49: {
			Clearscreen();
			break;
		}
		default: {
			continue;
		}
		}
		break;
	}
	print_dice_pair();
	Battle_ATK();
	printf("==============================================================================================================\n\n");
	Sleep(750);
	printf("\"이런 식으로 선택을 마치면 주사위를 굴린다.\"\n");
	Sleep(750);
	printf("\"나온 값에 따라 상대에게 피해를 가할 공격값이 정해지는 식이지.\"\n");
	Sleep(750);
	printf("\"데미지를 가한 후에는 턴이 종료된다.\"\n\n");
	Sleep(750);
	printf("==============================================================================================================\n\n");
	Sleep(500);
	system("pause");
	Clearscreen();
	print_dice_pair();
	printf("==============================================================================================================\n\n");
	printf("\20[%d턴]\t[상대의 턴]\n\n\n", ++Battleturn);
	printf("[ 수상한 남성 ]\n[적의 체력 : %d/%d]\t[적의 행운 : %d]\n\n\n", Mob_Hp, Mob_Maxhp, Mob_Luck);
	printf("[당신의 체력 : %d/%d]\n[행운 : %d]\t\t[믿음 : %d]\n\n\n", P_Hp, P_Maxhp, P_Luck, P_Belief);
	printf("상대는 당신에게 %d만큼 피해를 입히려고 합니다.\n\n\n", Mob_DMG());
	printf("--------------------------------------------------------------------------------------------------------------\n\n\n");
	printf("[(1) 방어한다.]\n[(2) 회피한다.]\n\n");
	printf("==============================================================================================================\n\n");
	printf("==============================================================================================================\n\n");
	Sleep(750);
	printf("\"네 턴이 끝나면 상대의 공격이 시작된다.\"\n");
	Sleep(750);
	printf("\"너는 [방어]와 [회피] 중 하나를 선택할 수 있지.\"\n");
	Sleep(750);
	printf("\"[방어]는 네 주사위 값만큼 적의 공격값을 감소시킨다.\"\n");
	Sleep(750);
	printf("\"무난하고 안정적인 선택지라고 볼 수 있지.\"\n");
	Sleep(750);
	printf("\"[회피]는 주사위 값이 띄울 수 있는 최댓값의 절반을 초과하면 성공한다.\"\n");
	Sleep(750);
	printf("\"간단하게 2분의 1확률이라고 보면 되겠지.\"\n");
	Sleep(750);
	printf("\"회피의 장점은 성공만 한다면 피해가 없다는 점이다.\"\n");
	Sleep(750);
	printf("\"그럼 네가 원하는 선택지를 골라봐라.\"\n\n");
	Sleep(750);
	printf("==============================================================================================================\n\n");
	Sleep(750);
	Choice = _getch();
	while (1) {
		switch (Choice) {
		case 49: {
			Clearscreen();
			print_dice_pair();
			Battle_DEF_1();
			break;
		}
		case 50: {
			Clearscreen();
			print_dice_pair();
			Battle_DEF_2();
			break;
		}
		default: {
			continue;
		}
		}
		break;
	}
	Clearscreen();
	printf("==============================================================================================================\n\n");
	Sleep(750);
	printf("\"어느정도 익숙해졌나보군.\"\n");
	Sleep(750);
	printf("\"자, 이제 본격적으로 전투를 시작하도록 하지.\"\n");
	Sleep(750);
	printf("\"그리고 전투에서 승리한다면 확률적으로 이벤트가 뜨니까 도망치지 않는 게 더 좋을거다.\"\n\n");
	Sleep(750);
	printf("그러나 수상한 남성의 바람을 이루어질 수 없었습니다.\n");
	Sleep(750);
	printf("맑고 화창한 하늘에서 떨어진 번개가 그를 강타했습니다.\n\n");
	Sleep(750);
	printf("\"크아아악!!!\"\n\n");
	Sleep(750);
	printf("당신에게 남은 것은 잿더미가 된 시체와 주사위, 그리고 미지의 숲을 걷는 것 뿐입니다.\n");
	Sleep(750);
	printf("말을 걸어주던 상대조차 사라진 당신은 담담히 숲을 걷기로 했습니다.\n\n");
	Sleep(750);
	printf("==============================================================================================================\n\n");
	system("pause");
	Clearscreen();
}